Revit 2026 API

# ElectricalSystemTrueLoadPhaseA Property

---

The TrueLoadPhaseA value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TrueLoadPhaseA { get; }
```
```vb
Public ReadOnly Property TrueLoadPhaseA As Double
	Get
```
```cpp
public:
property double TrueLoadPhaseA {
	double get ();
}
```
```fsharp
member TrueLoadPhaseA : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the TrueLoadPhaseA value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace